{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 76,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 77,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 78,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 79,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 80,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "relational_sort_descending": 0,
      "4": 1,
      "conditional_increment_odds": 2,
      "result": 3,
      "-2": 4,
      "removal_remove_greater_than_5": 5,
      "special_relative_position": 6,
      "-3": 7,
      "sliding_rotate_by_two": 8,
      "3": 9,
      "mappings_add_one": 10,
      "mappings_square_each": 11,
      "pattern_wave_pattern": 12,
      "special_frequency_map": 13,
      "0": 14,
      "input": 15,
      "pattern_repeat_pattern": 16,
      "sliding_reverse_each_pair": 17,
      "conditional_zero_greater_than_5": 18,
      "permutations_swap_second_third": 19,
      "sliding_shift_left": 20,
      "2": 21,
      "special_unique_count": 22,
      "relational_greater_than_5_first": 23,
      "permutations_swap_first_last": 24,
      "special_position_value": 25,
      ":": 26,
      "-5": 27,
      "pattern_alternate_signs": 28,
      "addition_append_reverse": 29,
      "5": 30,
      "permutations_rotate_left_one": 31,
      "relational_even_odd_separate": 32,
      "-4": 33,
      "mathematical_running_max": 34,
      "mathematical_prefix_sum": 35,
      "-10": 36,
      "conditional_negate_odds": 37,
      "pattern_staircase": 38,
      "-7": 39,
      "removal_remove_duplicates": 40,
      "addition_append_zero": 41,
      "removal_remove_zeros": 42,
      "mappings_mod_three": 43,
      "mappings_negate_each": 44,
      "permutations_rotate_right_one": 45,
      "9": 46,
      "8": 47,
      "1": 48,
      "7": 49,
      "addition_prepend_zero": 50,
      "sliding_shift_right": 51,
      "mathematical_difference_array": 52,
      "relational_sort_ascending": 53,
      "sliding_swap_adjacent_pairs": 54,
      "addition_repeat_each": 55,
      "mappings_double_each": 56,
      "permutations_reverse_first_three": 57,
      "mathematical_running_min": 58,
      "-8": 59,
      "removal_remove_evens": 60,
      "-6": 61,
      "6": 62,
      "conditional_double_evens": 63,
      "-1": 64,
      "-9": 65,
      "pattern_mirror_array": 66,
      "conditional_zero_evens": 67,
      "relational_smallest_first": 68,
      "[": 69,
      "]": 70,
      "addition_interleave_zeros": 71,
      "mathematical_cumulative_sum": 72,
      ";": 73,
      "operation": 74,
      "removal_remove_odds": 75
    },
    "unk_token": "[UNK]"
  }
}