{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 77,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 78,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 79,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 80,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 81,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "operation": 0,
      "pattern_wave_pattern": 1,
      "mathematical_running_max": 2,
      "mathematical_cumulative_sum": 3,
      "conditional_zero_evens": 4,
      "addition_append_reverse": 5,
      "special_frequency_map": 6,
      "removal_remove_duplicates": 7,
      "-5": 8,
      "relational_even_odd_separate": 9,
      "permutations_swap_first_last": 10,
      "9": 11,
      "pattern_mirror_array": 12,
      "sliding_shift_right": 13,
      "removal_remove_evens": 14,
      "special_position_value": 15,
      "relational_sort_descending": 16,
      "addition_append_zero": 17,
      "sliding_swap_adjacent_pairs": 18,
      "result": 19,
      "mappings_add_one": 20,
      "removal_remove_greater_than_5": 21,
      "-6": 22,
      "3": 23,
      "addition_interleave_zeros": 24,
      "addition_prepend_zero": 25,
      "sliding_shift_left": 26,
      "sliding_rotate_by_two": 27,
      "sliding_reverse_each_pair": 28,
      "-10": 29,
      "conditional_negate_odds": 30,
      "conditional_double_evens": 31,
      "special_relative_position": 32,
      "EOS": 33,
      "2": 34,
      "permutations_rotate_right_one": 35,
      "mappings_negate_each": 36,
      "mappings_square_each": 37,
      "mappings_double_each": 38,
      "-1": 39,
      "-8": 40,
      "relational_smallest_first": 41,
      "permutations_reverse_first_three": 42,
      "conditional_zero_greater_than_5": 43,
      "mathematical_difference_array": 44,
      "input": 45,
      "pattern_repeat_pattern": 46,
      "-7": 47,
      "6": 48,
      "[": 49,
      "-3": 50,
      "8": 51,
      "special_unique_count": 52,
      "permutations_swap_second_third": 53,
      "pattern_staircase": 54,
      "-2": 55,
      ";": 56,
      "-4": 57,
      "removal_remove_odds": 58,
      "removal_remove_zeros": 59,
      "relational_sort_ascending": 60,
      "addition_repeat_each": 61,
      "relational_greater_than_5_first": 62,
      "mappings_mod_three": 63,
      "]": 64,
      "conditional_increment_odds": 65,
      "pattern_alternate_signs": 66,
      "5": 67,
      "permutations_rotate_left_one": 68,
      "7": 69,
      ":": 70,
      "mathematical_running_min": 71,
      "0": 72,
      "1": 73,
      "mathematical_prefix_sum": 74,
      "4": 75,
      "-9": 76
    },
    "unk_token": "[UNK]"
  }
}