{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 221,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 222,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 223,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 224,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 225,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "addition_interleave_zeros_sliding_swap_adjacent_pairs": 0,
      "mathematical_running_max_special_relative_position": 1,
      "special_position_value_pattern_wave_pattern": 2,
      "relational_sort_descending_mappings_negate_each": 3,
      "removal_remove_greater_than_5_pattern_alternate_signs": 4,
      ";": 5,
      "relational_even_odd_separate_addition_interleave_zeros": 6,
      "permutations_swap_second_third_conditional_zero_greater_than_5": 7,
      "5": 8,
      "mathematical_running_max_conditional_increment_odds": 9,
      "conditional_double_evens_sliding_reverse_each_pair": 10,
      "sliding_shift_right_removal_remove_odds": 11,
      "mappings_add_one_removal_remove_zeros": 12,
      "pattern_wave_pattern_conditional_double_evens": 13,
      "conditional_zero_greater_than_5_removal_remove_zeros": 14,
      "sliding_rotate_by_two_mathematical_running_min": 15,
      "mathematical_difference_array_pattern_alternate_signs": 16,
      "pattern_wave_pattern_relational_greater_than_5_first": 17,
      "conditional_negate_odds_pattern_mirror_array": 18,
      "special_unique_count_addition_interleave_zeros": 19,
      "pattern_alternate_signs_mappings_negate_each": 20,
      "special_position_value_conditional_zero_evens": 21,
      "mappings_double_each_addition_append_zero": 22,
      "mappings_square_each_permutations_rotate_left_one": 23,
      "addition_repeat_each_special_relative_position": 24,
      "permutations_swap_first_last_mappings_add_one": 25,
      "mappings_add_one_pattern_staircase": 26,
      "pattern_staircase_conditional_increment_odds": 27,
      "sliding_swap_adjacent_pairs_special_unique_count": 28,
      ":": 29,
      "special_position_value_addition_repeat_each": 30,
      "pattern_staircase_removal_remove_evens": 31,
      "9": 32,
      "mappings_double_each_conditional_negate_odds": 33,
      "relational_greater_than_5_first_permutations_rotate_left_one": 34,
      "addition_append_zero_sliding_reverse_each_pair": 35,
      "pattern_mirror_array_conditional_zero_evens": 36,
      "special_frequency_map_conditional_zero_greater_than_5": 37,
      "permutations_swap_first_last_conditional_double_evens": 38,
      "addition_interleave_zeros_special_relative_position": 39,
      "pattern_staircase_addition_append_zero": 40,
      "removal_remove_duplicates_permutations_swap_first_last": 41,
      "sliding_reverse_each_pair_pattern_wave_pattern": 42,
      "permutations_swap_second_third_conditional_negate_odds": 43,
      "sliding_rotate_by_two_special_relative_position": 44,
      "operation": 45,
      "special_relative_position_removal_remove_odds": 46,
      "addition_append_zero_sliding_rotate_by_two": 47,
      "sliding_swap_adjacent_pairs_mappings_square_each": 48,
      "permutations_reverse_first_three_mathematical_difference_array": 49,
      "mathematical_difference_array_special_relative_position": 50,
      "mappings_negate_each_special_position_value": 51,
      "sliding_reverse_each_pair_mathematical_running_max": 52,
      "mathematical_running_max_permutations_rotate_left_one": 53,
      "conditional_zero_greater_than_5_sliding_shift_right": 54,
      "pattern_mirror_array_conditional_double_evens": 55,
      "removal_remove_zeros_addition_repeat_each": 56,
      "permutations_rotate_left_one_sliding_shift_right": 57,
      "mappings_square_each_mappings_mod_three": 58,
      "pattern_alternate_signs_sliding_shift_left": 59,
      "permutations_reverse_first_three_removal_remove_duplicates": 60,
      "addition_repeat_each_mappings_mod_three": 61,
      "conditional_increment_odds_sliding_shift_left": 62,
      "relational_sort_descending_mathematical_running_max": 63,
      "-6": 64,
      "relational_even_odd_separate_mappings_mod_three": 65,
      "addition_interleave_zeros_conditional_zero_evens": 66,
      "permutations_rotate_left_one_sliding_reverse_each_pair": 67,
      "relational_even_odd_separate_relational_smallest_first": 68,
      "mathematical_cumulative_sum_mathematical_difference_array": 69,
      "1": 70,
      "mathematical_running_min_mappings_add_one": 71,
      "permutations_rotate_left_one_mappings_double_each": 72,
      "sliding_swap_adjacent_pairs_conditional_double_evens": 73,
      "relational_sort_ascending_permutations_reverse_first_three": 74,
      "sliding_rotate_by_two_sliding_shift_right": 75,
      "mathematical_prefix_sum_addition_interleave_zeros": 76,
      "sliding_shift_left_addition_repeat_each": 77,
      "addition_repeat_each_addition_prepend_zero": 78,
      "mappings_negate_each_relational_greater_than_5_first": 79,
      "-3": 80,
      "conditional_double_evens_removal_remove_odds": 81,
      "result": 82,
      "mappings_double_each_conditional_double_evens": 83,
      "-7": 84,
      "removal_remove_duplicates_conditional_zero_greater_than_5": 85,
      "permutations_rotate_right_one_mathematical_running_min": 86,
      "mappings_add_one_pattern_alternate_signs": 87,
      "permutations_rotate_right_one_addition_repeat_each": 88,
      "removal_remove_zeros_removal_remove_odds": 89,
      "conditional_double_evens_special_position_value": 90,
      "mathematical_prefix_sum_mathematical_difference_array": 91,
      "conditional_zero_evens_addition_prepend_zero": 92,
      "sliding_swap_adjacent_pairs_sliding_shift_left": 93,
      "conditional_zero_evens_mathematical_difference_array": 94,
      "removal_remove_greater_than_5_permutations_reverse_first_three": 95,
      "relational_sort_descending_addition_append_zero": 96,
      "mappings_negate_each_relational_sort_descending": 97,
      "addition_append_reverse_relational_sort_ascending": 98,
      "pattern_repeat_pattern_relational_greater_than_5_first": 99,
      "conditional_double_evens_relational_smallest_first": 100,
      "special_frequency_map_mappings_mod_three": 101,
      "addition_prepend_zero_permutations_reverse_first_three": 102,
      "permutations_swap_first_last_sliding_swap_adjacent_pairs": 103,
      "pattern_repeat_pattern_sliding_shift_right": 104,
      "mathematical_prefix_sum_conditional_negate_odds": 105,
      "2": 106,
      "-8": 107,
      "relational_even_odd_separate_mathematical_running_min": 108,
      "pattern_alternate_signs_mappings_square_each": 109,
      "conditional_negate_odds_mappings_double_each": 110,
      "mappings_double_each_mappings_square_each": 111,
      "relational_smallest_first_sliding_shift_left": 112,
      "0": 113,
      "pattern_staircase_mappings_negate_each": 114,
      "addition_append_reverse_special_position_value": 115,
      "sliding_rotate_by_two_pattern_repeat_pattern": 116,
      "sliding_shift_left_removal_remove_odds": 117,
      "mathematical_running_min_addition_interleave_zeros": 118,
      "special_unique_count_sliding_rotate_by_two": 119,
      "addition_append_zero_permutations_reverse_first_three": 120,
      "sliding_reverse_each_pair_special_position_value": 121,
      "relational_smallest_first_conditional_increment_odds": 122,
      "addition_repeat_each_conditional_double_evens": 123,
      "-4": 124,
      "permutations_swap_second_third_pattern_staircase": 125,
      "-5": 126,
      "mathematical_cumulative_sum_sliding_rotate_by_two": 127,
      "relational_sort_ascending_permutations_swap_first_last": 128,
      "special_frequency_map_mathematical_difference_array": 129,
      "special_position_value_pattern_staircase": 130,
      "relational_smallest_first_mappings_square_each": 131,
      "mappings_square_each_relational_greater_than_5_first": 132,
      "pattern_repeat_pattern_removal_remove_odds": 133,
      "special_relative_position_relational_sort_ascending": 134,
      "mathematical_prefix_sum_permutations_rotate_left_one": 135,
      "mappings_add_one_conditional_negate_odds": 136,
      "mathematical_running_min_mappings_negate_each": 137,
      "mappings_mod_three_conditional_zero_evens": 138,
      "special_relative_position_mappings_double_each": 139,
      "removal_remove_zeros_pattern_wave_pattern": 140,
      "6": 141,
      "conditional_negate_odds_permutations_reverse_first_three": 142,
      "relational_greater_than_5_first_pattern_mirror_array": 143,
      "mappings_mod_three_permutations_swap_first_last": 144,
      "removal_remove_evens_sliding_shift_right": 145,
      "mathematical_difference_array_conditional_zero_evens": 146,
      "conditional_zero_evens_sliding_swap_adjacent_pairs": 147,
      "removal_remove_duplicates_permutations_swap_second_third": 148,
      "sliding_shift_right_mathematical_prefix_sum": 149,
      "relational_sort_ascending_special_relative_position": 150,
      "mathematical_running_max_conditional_negate_odds": 151,
      "mathematical_difference_array_conditional_negate_odds": 152,
      "removal_remove_duplicates_removal_remove_zeros": 153,
      "addition_prepend_zero_sliding_rotate_by_two": 154,
      "removal_remove_odds_mappings_mod_three": 155,
      "permutations_rotate_right_one_mathematical_cumulative_sum": 156,
      "conditional_increment_odds_conditional_zero_evens": 157,
      "mappings_negate_each_special_frequency_map": 158,
      "addition_append_reverse_conditional_increment_odds": 159,
      "sliding_shift_left_relational_even_odd_separate": 160,
      "special_relative_position_sliding_swap_adjacent_pairs": 161,
      "-10": 162,
      "permutations_rotate_left_one_permutations_swap_second_third": 163,
      "removal_remove_odds_mathematical_difference_array": 164,
      "[": 165,
      "removal_remove_odds_conditional_zero_greater_than_5": 166,
      "3": 167,
      "sliding_shift_left_sliding_swap_adjacent_pairs": 168,
      "removal_remove_zeros_special_frequency_map": 169,
      "special_unique_count_conditional_zero_evens": 170,
      "relational_greater_than_5_first_mappings_double_each": 171,
      "conditional_zero_greater_than_5_sliding_swap_adjacent_pairs": 172,
      "relational_sort_ascending_addition_append_reverse": 173,
      "permutations_swap_first_last_pattern_alternate_signs": 174,
      "removal_remove_evens_permutations_swap_first_last": 175,
      "mappings_mod_three_pattern_staircase": 176,
      "relational_smallest_first_permutations_rotate_right_one": 177,
      "relational_greater_than_5_first_addition_append_reverse": 178,
      "-2": 179,
      "addition_append_zero_sliding_shift_left": 180,
      "input": 181,
      "conditional_increment_odds_mathematical_running_min": 182,
      "addition_interleave_zeros_pattern_repeat_pattern": 183,
      "mappings_mod_three_mappings_square_each": 184,
      "7": 185,
      "8": 186,
      "removal_remove_evens_mappings_double_each": 187,
      "relational_sort_descending_mappings_mod_three": 188,
      "mathematical_cumulative_sum_permutations_swap_second_third": 189,
      "pattern_mirror_array_addition_prepend_zero": 190,
      "sliding_shift_right_addition_prepend_zero": 191,
      "removal_remove_odds_special_frequency_map": 192,
      "mappings_square_each_sliding_rotate_by_two": 193,
      "conditional_increment_odds_permutations_reverse_first_three": 194,
      "sliding_reverse_each_pair_relational_smallest_first": 195,
      "conditional_zero_greater_than_5_special_frequency_map": 196,
      "pattern_mirror_array_mappings_mod_three": 197,
      "removal_remove_greater_than_5_special_position_value": 198,
      "pattern_wave_pattern_relational_smallest_first": 199,
      "mathematical_cumulative_sum_removal_remove_greater_than_5": 200,
      "permutations_swap_second_third_relational_even_odd_separate": 201,
      "permutations_reverse_first_three_conditional_double_evens": 202,
      "pattern_alternate_signs_removal_remove_duplicates": 203,
      "conditional_negate_odds_relational_smallest_first": 204,
      "pattern_repeat_pattern_pattern_wave_pattern": 205,
      "addition_prepend_zero_removal_remove_evens": 206,
      "addition_prepend_zero_permutations_rotate_left_one": 207,
      "]": 208,
      "-9": 209,
      "conditional_zero_evens_mappings_mod_three": 210,
      "removal_remove_greater_than_5_removal_remove_zeros": 211,
      "permutations_rotate_right_one_conditional_increment_odds": 212,
      "permutations_reverse_first_three_special_relative_position": 213,
      "removal_remove_evens_addition_append_reverse": 214,
      "sliding_shift_right_relational_greater_than_5_first": 215,
      "special_unique_count_sliding_shift_left": 216,
      "mathematical_running_min_pattern_wave_pattern": 217,
      "special_frequency_map_sliding_reverse_each_pair": 218,
      "-1": 219,
      "4": 220
    },
    "unk_token": "[UNK]"
  }
}